

[
  {
    "id": "overview",
    "title": "College Overview",
    "content": "Mangalam College of Engineering, established in 2002 in Ettumanoor, Kottayam, is a premier institution approved by AICTE, affiliated with Mahatma Gandhi University, and accredited by NAAC (A grade, 3.24 CGPA) and NBA for Civil, CSE, ECE, and Mechanical programs. The college embodies the values of 'Inspire, Imbibe, and Innovate' and is committed to student-centric learning, research, and social responsibility."
  },
  {
    "id": "vision",
    "title": "Vision",
    "content": "To emerge as a centre of excellence in technical education and research, creating employable and committed professionals."
  },
  {
    "id": "mission",
    "title": "Mission",
    "content": "To inspire learners to be globally competent engineers through innovative teaching and learning methods, and to imbibe in them a sense of social responsibility and creative inquiry leading to higher learning and research."
  },
  {
    "id": "principal",
    "title": "Principal",
    "content": "The current Principal of Mangalam College of Engineering is Prof. Dr. Vinodh P. Vijayan, who holds a degree in Electronics & Communication Engineering and serves as head of the institution. Dr. Vinodh P Vijayan is the Principal of Mangalam College of Engineering, Kottayam, India. He is currently pursuing postdoctoral research with the University of Putra Malaysia. He holds a Bachelor's Degree in Electronics and Communication Engineering, a Master's Degree in Computer Science and Engineering from Anna University, Chennai, and a Ph.D. in Computer Science and Engineering from Vels Institute of Science, Technology, and Advanced Studies (VISTAS), Chennai. Dr. Vijayan has extensive experience teaching undergraduate and postgraduate programs affiliated with M.G. University and APJ Abdul Kalam Technological University (APJAKTU). He has served as an Adjunct Professor for the postgraduate programs of IGNOU and as a visiting faculty member for BITS Pilani's postgraduate programs. Currently, he is an approved research supervisor at APJAKTU. He has presented and published numerous papers in national and international conferences and has been actively involved in organizing these events. His publications appear in SCI, SCIE, and Scopus-indexed international journals and proceedings. Recently, he was credited with four published patents. Additionally, Dr. Vijayan has served as an author and reviewer for many technical publications and Ph.D. theses. His research interests include Soft Computing, Artificial Intelligence (AI), Bio-inspired Computing, Computer Networks, and the Internet of Things (IoT).",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
  "id": "vice-principals",
  "title": "Vice Principals of the Institution",
  "content": "We are proud to have two dedicated Vice Principals leading different spheres of our academic community:\n\n1. **Dr. Arun Jose – Vice Principal, Student Affairs**\nDr. Arun Jose, who completed his PhD at the National Institute of Technology, Tiruchirappalli, oversees student affairs at our institution. His areas of expertise include Supply Chain Management, Traceability Systems, and Sustainable Production. With a commitment to enhancing student life and well-being, Dr. Arun Jose ensures that the holistic needs of students are met.\n\n2. **Dr. Neema George – Vice Principal, Academics**\nDr. Neema George leads our academic programs and is known for her distinguished track record in academics and various student-centered activities. Her leadership plays a key role in shaping the institution’s academic culture and fostering an environment conducive to learning and innovation.\n\nBoth Vice Principals work collaboratively to ensure that our students receive a well-rounded educational experience, balancing academic excellence and student development.",
  "url": "https://mangalam.ac.in/faculty",
  "lastModified": "2025-09-29T00:00:00.000Z"
},

  {
    "id": "vice-principal-student-affairs",
    "title": "Vice Principal Student Affairs",
    "content": "The vice principal of student affairs is Dr. Arun Jose. Dr. Arun Jose completed his PhD at the National Institute of Technology, Tiruchirappalli. His areas of interest are Supply chain management, Traceability systems, and Sustainable production.",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "vice-principal-academics",
    "title": "Vice Principal Academics",
    "content": "The vice principal, academics of this institution is Dr. Neema George who has distingushed track record in academics and various student activities.",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "leadership",
    "title": "Leadership & Academic Structure",
    "content": "Principal: Prof. Dr. Vinodh P. Vijayan (Ph.D. in Computer Science and Engineering, postdoc at University of Putra Malaysia, expertise in AI, Soft Computing, IoT, 4 patents, research supervisor at APJAKTU). Vice Principal (Student Affairs): Dr. Arun Jose (Ph.D. NIT Trichy, Supply Chain Management, Traceability Systems, Sustainable Production). Vice Principal (Academics): Dr. Neema George (Academic quality, inclusivity, research-oriented practices)."
  },
  {
    "id": "departments",
    "title": "Academic Departments",
    "content": "Mangalam offers undergraduate, postgraduate, and doctoral programs in Civil, Mechanical, Electrical & Electronics, Electronics & Communication (ECE), Computer Science & Engineering (CSE), Chemical Engineering, Artificial Intelligence & Machine Learning (AI & ML), and Management (MBA, MCA, Ph.D.). Each department is led by distinguished faculty and offers modern labs and research opportunities."
  },
  {
    "id": "department-civil",
    "title": "Civil Engineering Department",
    "content": "Established in 2010, offers B.Tech and M.Tech (Structural Engineering & Construction Management). Led by Prof. Dr. D. Ramesh Kumar, focuses on fundamentals, design thinking, and industry collaboration."
  },
  {
    "id": "department-mechanical",
    "title": "Mechanical Engineering Department",
    "content": "Started in 2002, B.Tech intake of 60, M.Tech in Industrial Engineering & Management, led by Prof. Dr. Pratheesh K. Advanced CAD/CAM labs, CNC machines, SolidWorks, NX CAM Express, focus on employability and innovation."
  },
  {
    "id": "department-ece",
    "title": "Electronics & Communication Engineering (ECE) Department",
    "content": "Founded in 2002, over 420 UG and 36 PG students, led by Prof. Dr. Abraham C. G. Labs in VLSI, Embedded Systems, Communication, Digital IC Design, research-driven learning."
  },
  {
    "id": "department-cse",
    "title": "Computer Science & Engineering (CSE) Department",
    "content": "Established in 2002, offers B.Tech (CSE, CSBS) and M.Tech (CSE). Headed by Dr. Simy Mary Kurian, 480 UG and 36 PG students, focus on computing excellence, research, and holistic skill development."
  },
  {
    "id": "department-applications",
    "title": "Department of Computer Applications",
    "content": "Formed in 2023, offers BCA and MCA (60 seats each). Led by Ms. Divya S. B. (Ph.D. pursuing in Machine Learning). Focus on innovation, open discussions, hands-on projects, interdisciplinary learning, IoT and AI experiments, open-source contributions."
  },
  {
    "id": "faculty-highlights",
    "title": "Faculty Highlights - Computer Applications",
    "content": "Dr. Nagarjuna E. (Professor, PhD, M.Tech, 17 years), Mr. Eldhose K. Paul (Associate Professor, M.Tech, 18 years), Ms. Ashwani Vijayachandran (Assistant Professor, M.Tech, PhD pursuing, 4 years), Ms. Banu Sumayya S (Assistant Professor, M.Tech, 5 years), Ms. Greeshmamol P. Kurian (Assistant Professor, MCA, 2 years), Ms. Kukkumol Thomas (Associate Professor, M.Tech, PhD pursuing, 17 years), Ms. Anju John (Assistant Professor, MCA, 1.5 years), Ms. Sree Lekshmi (Assistant Professor, MCA, 1.5 years)."
  },
  {
    "id": "other-departments",
    "title": "Other Departments",
    "content": "Management Studies (MBA, MCA) led by Dr. Jacob Thomas. Electrical & Electronics Engineering, Chemical Engineering, and AI & ML departments focus on research, innovation labs, and entrepreneurship."
  },
  {
    "id": "student-life",
    "title": "Student Life & Activities",
    "content": "IEEE, CSI, ICI, IETE, IEI, NCC, NSS units. Annual TechFest, ArtsFest, Sports Day, Merit Day, skill-building, induction, outreach. NCC trains 160 cadets. Clubs and innovation hubs include technical associations, entrepreneurship cells, AI & ML IoT Centre of Excellence, IDEA Lab, cultural clubs."
  },
  {
    "id": "social-service",
    "title": "Social Service & Outreach",
    "content": "Departments participate in school and ashram visits, environmental awareness drives, sustainable development, connecting classroom learning with real-world empathy and service."
  },
  {
    "id": "innovation-hubs",
    "title": "Clubs, Cells & Innovation Hubs",
    "content": "Technical Clubs: IEEE, CSI, ACM, domain-specific associations. Entrepreneurship Cells, Technology Business Incubator, AI & ML IoT Centre of Excellence, IDEA Lab, Innovation Hub, cultural and social clubs. Hackathons, workshops, collaborative projects."
  },
  {
    "id": "philosophy",
    "title": "Core Philosophy",
    "content": "Mangalam College of Engineering believes learning is a continuous process of inspiration, curiosity, and contribution. 'Education is not just about learning facts — it’s about creating minds that think, build, and lead.'"
  }
]
