[
  {
    "id": "overview",
    "title": "College Overview",
    "content": "Mangalam College of Engineering was established in 2002, situated in the ettumanoor in Kottayam offering undergraduate programs in Civil, Mechanical, Electrical & Electronics, Electronics & Communication, Computer Science & Engineering, Chemical Engineering, and AI & ML, along with postgraduate degrees (M.Tech) and management degrees (MBA, MCA, Ph.D.) . The institution is AICTE-approved, affiliated to Mahatma Gandhi University, rated NAAC “A” grade with 3.24 CGPA, and NBA-accredited for its Civil, CSE, ECE, and Mechanical programs. Each department has a vison and mission and it clearly depicted on the course and program outcome of the course. The institution is clearly depicted with an idea of student centric and learning oriented activities. The core values of the institution includes inspire, Imbibe and Innovate. The management and staffs are very much truthful in creating such an idea and environment in the students.",
    "url": "https://mangalam.ac.in/",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "vision-mission",
    "title": "Vision and Mission",
    "content": "The vision is the institution is to emerge as a center of excellence in technical education and research, creating employable and committed professionals. The mission of the institution is to Inspire the learners to be globally competent engineers through innovative teaching and learning methods and imbibe a sense of social responsibility and creative inquiry in them that leads to higher learning and research.",
    "url": "https://mangalam.ac.in/about",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "principal",
    "title": "Principal",
    "content": "The current Principal of Mangalam College of Engineering is Prof. Dr. Vinodh P. Vijayan, who holds a degree in Electronics & Communication Engineering and serves as head of the institution. Dr. Vinodh P Vijayan is the Principal of Mangalam College of Engineering, Kottayam, India. He is currently pursuing postdoctoral research with the University of Putra Malaysia. He holds a Bachelor's Degree in Electronics and Communication Engineering, a Master's Degree in Computer Science and Engineering from Anna University, Chennai, and a Ph.D. in Computer Science and Engineering from Vels Institute of Science, Technology, and Advanced Studies (VISTAS), Chennai. Dr. Vijayan has extensive experience teaching undergraduate and postgraduate programs affiliated with M.G. University and APJ Abdul Kalam Technological University (APJAKTU). He has served as an Adjunct Professor for the postgraduate programs of IGNOU and as a visiting faculty member for BITS Pilani's postgraduate programs. Currently, he is an approved research supervisor at APJAKTU. He has presented and published numerous papers in national and international conferences and has been actively involved in organizing these events. His publications appear in SCI, SCIE, and Scopus-indexed international journals and proceedings. Recently, he was credited with four published patents. Additionally, Dr. Vijayan has served as an author and reviewer for many technical publications and Ph.D. theses. His research interests include Soft Computing, Artificial Intelligence (AI), Bio-inspired Computing, Computer Networks, and the Internet of Things (IoT).",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "vice-principal-student-affairs",
    "title": "Vice Principal Student Affairs",
    "content": "The vice principal of student affairs is Dr. Arun Jose. Dr. Arun Jose completed his PhD at the National Institute of Technology, Tiruchirappalli. His areas of interest are Supply chain management, Traceability systems, and Sustainable production.",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "vice-principal-academics",
    "title": "Vice Principal Academics",
    "content": "The vice principal, academics of this institution is Dr. Neema George who has distingushed track record in academics and various student activities.",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "departments",
    "title": "Departments and Programs",
    "content": "Mangalam College of Engineering offers undergraduate and postgraduate programs in Civil, Mechanical, Electrical & Electronics, Electronics & Communication, Computer Science & Engineering, Chemical Engineering, AI & ML, MBA, MCA, and Ph.D. Each department has dedicated faculty, labs, and research activities. Department heads and faculty details are available on the college website.",
    "url": "https://mangalam.ac.in/departments",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "student-activities",
    "title": "Student Activities and Clubs",
    "content": "Active student bodies include IEEE, CSI, ICI, IETE, IEI, NCC, NSS units, which organize technical and social initiatives including ArtsFest, TechFest, Sports Day, Merit Day, induction programs, and more. The NCC unit was established under the 16 Kerala Battalion with training for around 160 cadets, complete with regular drills and leadership training. Clubs and innovation hubs include technical associations, entrepreneurship cells, IDEA Lab, social and cultural clubs, and the AI & ML-IoT Centre of Excellence.",
    "url": "https://mangalam.ac.in/student-life",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "social-service",
    "title": "Social Service and Outreach",
    "content": "Each department participates in structured social service programs—visits to local homes, schools, and ashrams, environmental awareness drives, and sustainable attitude development initiatives for students through the official Social Service wing. These activities link academic curriculum with community service via student-led field visits and awareness programs.",
    "url": "https://mangalam.ac.in/social-service",
    "lastModified": "2025-09-29T00:00:00.000Z"
  },
  {
    "id": "college-name",
    "title": "College Name",
    "content": "Mangalam College of Engineering",
    "url": "https://mangalam.ac.in/",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "college-location",
    "title": "College Location",
    "content": "Mangalam College of Engineering is located in Ettumanoor, Kottayam, Kerala, India.",
    "url": "https://mangalam.ac.in/contact",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "college-principal",
    "title": "College Principal",
    "content": "The principal of Mangalam College of Engineering is Dr. John Mathew.",
    "url": "https://mangalam.ac.in/faculty",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "sample-1",
    "title": "Computer Science Program",
    "content": "The Computer Science program offers undergraduate and graduate degrees with focus on software engineering, artificial intelligence, and data science. Prerequisites include calculus and physics. The program duration is 4 years for undergraduate and 2 years for graduate studies.",
    "url": "https://example.edu/cs-program",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "sample-2",
    "title": "Admissions Requirements",
    "content": "Undergraduate admissions require a high school diploma with minimum 3.0 GPA, SAT score of 1200+ or ACT score of 26+, and two letters of recommendation. Graduate admissions require a bachelor's degree, GRE scores, and statement of purpose.",
    "url": "https://example.edu/admissions",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "sample-3",
    "title": "Campus Facilities",
    "content": "Our campus features modern dormitories, a state-of-the-art library with 24/7 access, multiple dining halls, recreational centers, and computer labs. The campus spans 200 acres with wireless internet throughout.",
    "url": "https://example.edu/facilities",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "sample-4",
    "title": "Financial Aid",
    "content": "Financial aid options include need-based grants, merit scholarships, work-study programs, and federal loans. Students must complete FAFSA by March 1st. Average aid package is $15,000 per year.",
    "url": "https://example.edu/financial-aid",
    "lastModified": "2025-09-28T00:00:00.000Z"
  },
  {
    "id": "sample-5",
    "title": "Student Life",
    "content": "Campus life includes over 100 student organizations, intramural sports, cultural events, and volunteer opportunities. Housing is guaranteed for first-year students. Career services provide internship and job placement assistance.",
    "url": "https://example.edu/student-life",
    "lastModified": "2025-09-28T00:00:00.000Z"
  }
]
